Yoda49/RA8875-driver-for-STM32F103/ra8875_driver.c
#include "RA8875.h"
#include "stm32f10x.h"
#include "stm32_sba.h"

unsigned int _width = 800;
unsigned int _height = 480;
unsigned char _textScale;

#define CS_LCD_HIGH GPIOA->BSRR = 1 << 4
#define CS_LCD_LOW  GPIOA->BRR  = 1 << 4

#define BLUE_LED_OFF  GPIOC->BSRR = 1 << 13
#define BLUE_LED_ON GPIOC->BRR  = 1 << 13

#define DISPLAY_BUSY_STATUS GPIOA->IDR & 1 << 3



// ======================================================================================
// HARDWARE DELAY SECTION
// ======================================================================================
#define    DWT_CYCCNT    *(volatile unsigned long *)0xE0001004
#define    DWT_CONTROL   *(volatile unsigned long *)0xE0001000
#define    SCB_DEMCR     *(volatile unsigned long *)0xE000EDFC

void delay_ms(unsigned int ms)
{
	unsigned int ms_count_tick =  ms * (SystemCoreClock/1000);
	SCB_DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
	DWT_CYCCNT  = 0;
	DWT_CONTROL|= DWT_CTRL_CYCCNTENA_Msk; 
	while (DWT_CYCCNT < ms_count_tick);
	DWT_CONTROL &= ~DWT_CTRL_CYCCNTENA_Msk;
}


// ======================================================================================
// display init
// ======================================================================================
void ra8875_init (void)
{
	
  unsigned char pixclk = RA8875_PCSR_PDATL | RA8875_PCSR_2CLK;
  unsigned char  hsync_start    = 32;
  unsigned char  hsync_pw       = 96;
  unsigned char  hsync_finetune = 0;
  unsigned char  hsync_nondisp  = 26;
  unsigned char  vsync_pw       = 2;
  unsigned int   vsync_nondisp  = 32;
  unsigned int   vsync_start    = 23;

	CONF_A (3, CNF_TRISTATE_IN, IN); // DISPLAY BUSY
	
	// SPI INIT
	RCC->APB2ENR |= RCC_APB2ENR_SPI1EN; // enable spi module
	RCC->APB2ENR |= RCC_APB2ENR_IOPAEN; // port a enable
	
	CONF_A (7, CNF_SPECIAL_OUT, OUT50); // MOSI SPI1
	CONF_A (6, CNF_TRISTATE_IN, IN);    // MISO SPI1
	CONF_A (5, CNF_SPECIAL_OUT, OUT50); // SCK SPI1
	CONF_A (4, CNF_DIGITAL_OUT, OUT50); // NSS SPI1
	
	SPI1->CR1 &= ~SPI_CR1_SPE; // SPI OFF
	SPI1->CR1 |= SPI_CR1_BR;   // low speed at start
	SPI1->CR1 |= SPI_CR1_CPOL;      // Polarity cls signal CPOL = 1;
  SPI1->CR1 |= SPI_CR1_CPHA;      // Phase cls signal    CPHA = 1;	
	//SPI1->CR1 &= ~SPI_CR1_DFF;      // 8 bit data
  SPI1->CR1 |= SPI_CR1_SSM;       // Soft NSS
  SPI1->CR1 |= SPI_CR1_SSI;       // Аналогично состоянию, когда на входе NSS высокий уровень
  SPI1->CR2 |= SPI_CR2_SSOE;      // Вывод NSS - выход управления slave select
	//SPI1->CR2 |= SPI_CR2_TXEIE;			// enable TX irq (if tx buffer is free)
  SPI1->CR1 |= SPI_CR1_MSTR;      // Master mode
  SPI1->CR1 |= SPI_CR1_SPE;       // SPI 1 on
	
	
	// RA8875 PLL CONFIGURE
  writeReg (RA8875_PLLC1, 11);
  delay_ms (100);
  writeReg(RA8875_PLLC2, RA8875_PLLC2_DIV4);
  delay_ms (100);
  writeReg (RA8875_SYSR, RA8875_SYSR_8BPP | RA8875_SYSR_MCU8);
  delay_ms (100);
  writeReg(RA8875_PCSR, pixclk);
  delay_ms (100);
  
	SPI1->CR1 &= ~SPI_CR1_SPE;
	SPI1->CR1 &= ~(SPI_CR1_BR_2 | SPI_CR1_BR_1); 
	SPI1->CR1 |= SPI_CR1_SPE;
	
	

  // Horizontal settings registers
  writeReg(RA8875_HDWR, 0x63); // (99 + 1) * 8 = 800 width
  writeReg(RA8875_HNDFTR, RA8875_HNDFTR_DE_HIGH + hsync_finetune);
  writeReg(RA8875_HNDR, (hsync_nondisp - hsync_finetune - 2)/8);    // H non-display: HNDR * 8 + HNDFTR + 2 = 10
  writeReg(RA8875_HSTR, hsync_start / 8 - 1);                         // Hsync start: (HSTR + 1)*8 
  writeReg(RA8875_HPWR, RA8875_HPWR_LOW + (hsync_pw/8 - 1));        // HSync pulse width = (HPWR+1) * 8
  
  // Vertical settings registers
  writeReg(RA8875_VDHR0, 0xDF);  // 1DF = 479 height
  writeReg(RA8875_VDHR1, 0x01);
  writeReg(RA8875_VNDR0, vsync_nondisp-1);                          // V non-display period = VNDR + 1
  writeReg(RA8875_VNDR1, vsync_nondisp >> 8);
  writeReg(RA8875_VSTR0, vsync_start-1);                            // Vsync start position = VSTR + 1
  writeReg(RA8875_VSTR1, vsync_start >> 8);
  writeReg(RA8875_VPWR, RA8875_VPWR_LOW + vsync_pw - 1);            // Vsync pulse width = VPWR + 1
  
  // Set active window X
  writeReg(RA8875_HSAW0, 0);                                        // horizontal start point
  writeReg(RA8875_HSAW1, 0);
  writeReg(RA8875_HEAW0, 0x1F); // 31F = 799
  writeReg(RA8875_HEAW1, 0x03);
  
  // Set active window Y
  writeReg(RA8875_VSAW0, 0);                                        // vertical start point
  writeReg(RA8875_VSAW1, 0);  
  writeReg(RA8875_VEAW0, 0xDF);           // horizontal end point
  writeReg(RA8875_VEAW1, 0x01);
  
  // ToDo: Setup touch panel?
  
  // Clear the entire window
  writeReg(RA8875_MCLR, RA8875_MCLR_START | RA8875_MCLR_FULL);
  delay_ms (500); 
}



void ra8875_spi1_switch_to_max_speed (void)
{
	SPI1->CR1 &= ~SPI_CR1_SPE;
	SPI1->CR1 &= ~(SPI_CR1_BR_2 | SPI_CR1_BR_1); 
	SPI1->CR1 |= SPI_CR1_SPE;
}

// ======================================================================================
// COLOR CONVERT RGB (3 byte) to RGB (1 byte)
// ======================================================================================
unsigned char rgb24_to_8 (unsigned char red, unsigned char green, unsigned char blue)
{
	red = red / 32;
	green = green / 32;
	blue = blue / 64;
	
	return (unsigned char)((red << 5) | (green << 2) | blue);
}


// ======================================================================================
// Software reset
// ======================================================================================
void ra8875_soft_reset(void)
{
  writeCommand(RA8875_PWRR);
  writeData(RA8875_PWRR_SOFTRESET);
  writeData(RA8875_PWRR_NORMAL);
  delay_ms(10);
}

// ======================================================================================
// Sets display on / off
// ======================================================================================
void ra8875_display_on (char on) 
{
	if (on) writeReg(RA8875_PWRR, RA8875_PWRR_NORMAL | RA8875_PWRR_DISPON); else writeReg(RA8875_PWRR, RA8875_PWRR_NORMAL | RA8875_PWRR_DISPOFF);
}

// ======================================================================================
// Sets sleep
// ======================================================================================
void ra8875_sleep (char sleep) 
{
	if (sleep) writeReg(RA8875_PWRR, RA8875_PWRR_DISPOFF | RA8875_PWRR_SLEEP); else writeReg(RA8875_PWRR, RA8875_PWRR_DISPOFF);
}




// ======================================================================================
// Sets the current X/Y position on the display before drawing
//    
// x[in] The 0-based x location
// y[in] The 0-base y location
// ======================================================================================
void ra8875_set_xy_position (unsigned int x, unsigned int y)
{
  writeReg (RA8875_CURH0, (unsigned char)x);
  writeReg (RA8875_CURH1, (unsigned char)(x >> 8));
  writeReg (RA8875_CURV0, (unsigned char)y);
  writeReg (RA8875_CURV1, (unsigned char)(y >> 8));
}


// ======================================================================================
// HW accelerated function to push a chunk of raw pixel data
//      
// num[in] The number of pixels to push
// p[in]   The pixel color to use
// ======================================================================================
void ra8875_draw_image (unsigned int x1, unsigned int y1, unsigned int x2, unsigned int y2, unsigned char * array, unsigned long count)
{
	unsigned long i = 0;
	  // Set active window X
  writeReg(RA8875_HSAW0, (unsigned char)x1);
  writeReg(RA8875_HSAW1, (unsigned char)(x1 >> 8));
  writeReg(RA8875_HEAW0, (unsigned char)x2);
  writeReg(RA8875_HEAW1, (unsigned char)(x2 >> 8));
  
