Yoda49/RA8875-driver-for-STM32F103/ra8875_driver.c
  // Set active window Y
  writeReg(RA8875_VSAW0, (unsigned char)y1);
  writeReg(RA8875_VSAW1, (unsigned char)(y1 >> 8));  
  writeReg(RA8875_VEAW0, (unsigned char)y2);
  writeReg(RA8875_VEAW1, (unsigned char)(y2 >> 8));
	
  writeReg (RA8875_CURH0, (unsigned char)x1);
  writeReg (RA8875_CURH1, (unsigned char)(x1 >> 8));
  writeReg (RA8875_CURV0, (unsigned char)y1);
  writeReg (RA8875_CURV1, (unsigned char)(y1 >> 8)); 
	
	CS_LCD_LOW;
	__nop ();
	
	SPI1->DR = RA8875_CMDWRITE;
	while (SPI1->SR & SPI_SR_BSY) {}
	SPI1->DR = RA8875_MRWC;
	while (SPI1->SR & SPI_SR_BSY) {}
		
	__nop ();
	CS_LCD_HIGH;
	__nop ();
	CS_LCD_LOW;
	__nop ();
	
	SPI1->DR = RA8875_DATAWRITE;
	while (SPI1->SR & SPI_SR_BSY) {}
		
  for (i = 0; i < count; i++)
	{
		SPI1->DR = array[i];
		while (SPI1->SR & SPI_SR_BSY) {}
  }

	__nop ();
	CS_LCD_HIGH;
	__nop ();
}





// ======================================================================================
// DRAW PIXEL
// ======================================================================================
void ra8875_draw_pixel(unsigned int x, unsigned int y, unsigned int color)
{
  writeReg (RA8875_CURH0, x);
  writeReg (RA8875_CURH1, x >> 8);
  writeReg (RA8875_CURV0, y);
  writeReg (RA8875_CURV1, y >> 8);  
	writeReg (RA8875_MRWC, color);
}


// ======================================================================================
// Draws a HW accelerated line on the display
// ======================================================================================
void ra8875_draw_line (unsigned int x0, unsigned int y0, unsigned int x1, unsigned int y1, unsigned int color)
{
  // Set active window X
  writeReg(RA8875_HSAW0, 0);
  writeReg(RA8875_HSAW1, 0);
  writeReg(RA8875_HEAW0, 0x1F);
  writeReg(RA8875_HEAW1, 0x03);
  
  // Set active window Y
  writeReg(RA8875_VSAW0, 0);
  writeReg(RA8875_VSAW1, 0);  
  writeReg(RA8875_VEAW0, 0xDF);
  writeReg(RA8875_VEAW1, 0x01);
	
	writeReg (RA8875_CURH0, 0);
	writeReg (RA8875_CURH1, 0);
	writeReg (RA8875_CURV0, 0);
	writeReg (RA8875_CURV1, 0); 
	
  /* Set X */
  writeReg(0x91, x0);
  writeReg(0x92, x0 >> 8);
  
  /* Set Y */
  writeReg(0x93, y0);
  writeReg(0x94, y0 >> 8);
  
  /* Set X1 */
  writeReg(0x95, x1);
  writeReg(0x96, x1 >> 8);

  /* Set Y1 */
  writeReg(0x97, y1);
  writeReg(0x98, y1 >> 8);
  
  /* Set Color */
  writeReg(RA8875_FGCR0, (color & 0xE0) >> 5); // red bits 7,6,5
  writeReg(RA8875_FGCR1, (color & 0x1C) >> 2);  // green bits 4,3,2
  writeReg(RA8875_FGCR2,  color & 0x03); // blue bits 1,0

  /* Draw! */
  writeReg(RA8875_DCR, 0x80);
  
	while (!(DISPLAY_BUSY_STATUS)) {}
}








// ======================================================================================
// Draws a HW accelerated circle on the display
//
// x[in]     The 0-based x location of the center of the circle
// y[in]     The 0-based y location of the center of the circle
// w[in]     The circle's radius
// color[in] The RGB565 color to use when drawing the pixel
// filled    True of false
// ======================================================================================
void ra8875_circle_draw(unsigned int x0, unsigned int y0, unsigned int r, unsigned char color, char filled)
{
  // Set active window X
  writeReg(RA8875_HSAW0, 0);
  writeReg(RA8875_HSAW1, 0);
  writeReg(RA8875_HEAW0, 0x1F);
  writeReg(RA8875_HEAW1, 0x03);
  
  // Set active window Y
  writeReg(RA8875_VSAW0, 0);
  writeReg(RA8875_VSAW1, 0);  
  writeReg(RA8875_VEAW0, 0xDF);
  writeReg(RA8875_VEAW1, 0x01);
	
	writeReg (RA8875_CURH0, 0);
	writeReg (RA8875_CURH1, 0);
	writeReg (RA8875_CURV0, 0);
	writeReg (RA8875_CURV1, 0); 
	
	
  /* Set X */
  writeReg (0x99, x0);
  writeReg (0x9a, x0 >> 8);
	
  /* Set Y */
  writeReg(0x9b, y0);
  writeReg(0x9c, y0 >> 8);	   
	
  /* Set Radius */
  writeReg(0x9d, r);
	
  /* Set Color */
  writeReg(RA8875_FGCR0, (color & 0xE0) >> 5); // red bits 7,6,5
  writeReg(RA8875_FGCR1, (color & 0x1C) >> 2);  // green bits 4,3,2
  writeReg(RA8875_FGCR2,  color & 0x03); // blue bits 1,0
	
  /* Draw! */
  if (filled) writeReg(RA8875_DCR, RA8875_DCR_CIRCLE_START | RA8875_DCR_FILL); else writeReg(RA8875_DCR, RA8875_DCR_CIRCLE_START | RA8875_DCR_NOFILL);

	while (!(DISPLAY_BUSY_STATUS)) {}
}







// ======================================================================================
// Draws a HW accelerated circle square on the display
//
// x[in]     The 0-based x location of the center of the circle
// y[in]     The 0-based y location of the center of the circle
// w[in]     The circle's radius
// color[in] The RGB565 color to use when drawing the pixel
// filled    True of false
// ======================================================================================
void ra8875_circle_sqr_draw (unsigned int x0, unsigned int y0, unsigned int x1, unsigned int y1,unsigned char r, unsigned char color, char filled)
{
    // Set active window X
    writeReg(RA8875_HSAW0, 0);
    writeReg(RA8875_HSAW1, 0);
    writeReg(RA8875_HEAW0, 0x1F);
    writeReg(RA8875_HEAW1, 0x03);
  
    // Set active window Y
    writeReg(RA8875_VSAW0, 0);
    writeReg(RA8875_VSAW1, 0);  
    writeReg(RA8875_VEAW0, 0xDF);
    writeReg(RA8875_VEAW1, 0x01);
	
    writeReg (RA8875_CURH0, 0);
    writeReg (RA8875_CURH1, 0);
	writeReg (RA8875_CURV0, 0);
	writeReg (RA8875_CURV1, 0); 
	
    /* Set X */
    writeReg(0x91, (unsigned char)x0);
    writeReg(0x92, (unsigned char)(x0 >> 8));

    /* Set Y */
    writeReg(0x93, (unsigned char)y0);
    writeReg(0x94, (unsigned char)(y0 >> 8));	   

    /* Set X1 */
    writeReg(0x95, (unsigned char)x1);
    writeReg(0x96, (unsigned char)(x1 >> 8));

    /* Set Y1 */
    writeReg(0x97, (unsigned char)y1);
    writeReg(0x98, (unsigned char)(y1 >> 8));   

    /* Set Radius */
    writeReg(0xA1, (unsigned char)r);
    writeReg(0xA2, (unsigned char)(r >> 8));   
    writeReg(0xA3, (unsigned char)r);
    writeReg(0xA4, (unsigned char)(r >> 8));   

    /* Set Color */
    writeReg(RA8875_FGCR0, (color & 0xE0) >> 5); // red bits 7,6,5
    writeReg(RA8875_FGCR1, (color & 0x1C) >> 2);  // green bits 4,3,2
    writeReg(RA8875_FGCR2,  color & 0x03); // blue bits 1,0

