Yoda49/RA8875-driver-for-STM32F103/ra8875_driver.c
    /* Draw! */
    if (filled) writeReg(0xA0, 0xE0); else writeReg(0xA0, 0xA0);

    while (!(DISPLAY_BUSY_STATUS)) {}
}

// ======================================================================================
//      Draws a HW accelerated rectangle on the display
//
//      x[in]     The 0-based x location of the top-right corner
//      y[in]     The 0-based y location of the top-right corner
//      w[in]     The rectangle width
//      h[in]     The rectangle height
//      color[in] The RGB565 color to use when drawing the pixel
//			filled    True or false
// ======================================================================================
void ra8875_rectangle_draw(unsigned int x0, unsigned int y0, unsigned int x1, unsigned int y1, unsigned char color, char filled)
{
  // Set active window X
  writeReg(RA8875_HSAW0, 0);
  writeReg(RA8875_HSAW1, 0);
  writeReg(RA8875_HEAW0, 0x1F);
  writeReg(RA8875_HEAW1, 0x03);
  
  // Set active window Y
  writeReg(RA8875_VSAW0, 0);
  writeReg(RA8875_VSAW1, 0);  
  writeReg(RA8875_VEAW0, 0xDF);
  writeReg(RA8875_VEAW1, 0x01);
	
	writeReg (RA8875_CURH0, 0);
	writeReg (RA8875_CURH1, 0);
	writeReg (RA8875_CURV0, 0);
	writeReg (RA8875_CURV1, 0); 
	
  /* Set X */
  writeReg(0x91, (unsigned char)x0);
  writeReg(0x92, (unsigned char)(x0 >> 8));
  
  /* Set Y */
  writeReg(0x93, (unsigned char)y0);
  writeReg(0x94, (unsigned char)(y0 >> 8));	   
  
  /* Set X1 */
  writeReg(0x95, (unsigned char)x1);
  writeReg(0x96, (unsigned char)(x1 >> 8));

  
  /* Set Y1 */
  writeReg(0x97, (unsigned char)y1);
  writeReg(0x98, (unsigned char)(y1 >> 8));

  /* Set Color */
  writeReg(0x63, (color & 0xE0) >> 5); // red bits 7,6,5
  writeReg(0x64, (color & 0x1C) >> 2);  // green bits 4,3,2
  writeReg(0x65,  color & 0x03); // blue bits 1,0

  /* Draw! */
  if (filled) writeReg(RA8875_DCR, 0xB0); else  writeReg(RA8875_DCR, 0x90);
  
	while (!(DISPLAY_BUSY_STATUS)) {}
}



// ======================================================================================
//      Draws a HW accelerated triangle on the display
//
//      x0[in]    The 0-based x location of point 0 on the triangle
//      0[in]     The 0-based y location of point 0 on the triangle
//      x1[in]    The 0-based x location of point 1 on the triangle
//      y1[in]    The 0-based y location of point 1 on the triangle
//      x2[in]    The 0-based x location of point 2 on the triangle
//      y2[in]    The 0-based y location of point 2 on the triangle
//      color[in] The RGB565 color to use when drawing the pixel
//			filled    True or false
// ======================================================================================
void ra8875_triangle_draw (unsigned int x0, unsigned int y0, unsigned int x1, unsigned int y1, unsigned int x2, unsigned int y2, unsigned char color, char filled)
{
  // Set active window X
  writeReg(RA8875_HSAW0, 0);
  writeReg(RA8875_HSAW1, 0);
  writeReg(RA8875_HEAW0, 0x1F);
  writeReg(RA8875_HEAW1, 0x03);
  
  // Set active window Y
  writeReg(RA8875_VSAW0, 0);
  writeReg(RA8875_VSAW1, 0);  
  writeReg(RA8875_VEAW0, 0xDF);
  writeReg(RA8875_VEAW1, 0x01);
	
	writeReg (RA8875_CURH0, 0);
	writeReg (RA8875_CURH1, 0);
	writeReg (RA8875_CURV0, 0);
	writeReg (RA8875_CURV1, 0); 
	
  /* Set Point 0 */
  writeReg(0x91, x0);
  writeReg(0x92, x0 >> 8);
  writeReg(0x93, y0);
  writeReg(0x94, y0 >> 8);

  /* Set Point 1 */
  writeReg(0x95, x1);
  writeReg(0x96, x1 >> 8);
  writeReg(0x97, y1);
  writeReg(0x98, y1 >> 8);

  /* Set Point 2 */
  writeReg(0xA9, x2);
  writeReg(0xAA, x2 >> 8);
  writeReg(0xAB, y2);
  writeReg(0xAC, y2 >> 8);
  
  /* Set Color */
  writeReg(0x63, (color & 0xE0) >> 5); // red bits 7,6,5
  writeReg(0x64, (color & 0x1C) >> 2);  // green bits 4,3,2
  writeReg(0x65,  color & 0x03); // blue bits 1,0
  
  /* Draw! */
  if (filled) writeReg(RA8875_DCR, 0xA1); else writeReg(RA8875_DCR, 0x81);
  
  /* Wait for the command to finish */
  while (!(DISPLAY_BUSY_STATUS)) {}
}



// ======================================================================================
//      Draws a HW accelerated ellipse on the display
//
//      xCenter[in]   The 0-based x location of the ellipse's center
//      yCenter[in]   The 0-based y location of the ellipse's center
//      longAxis[in]  The size in pixels of the ellipse's long axis
//      shortAxis[in] The size in pixels of the ellipse's short axis
//      color[in]     The RGB565 color to use when drawing the pixel
//			filled    		True or false
// ======================================================================================
void ra8875_ellipse_draw (unsigned int xCenter, unsigned int yCenter, unsigned int longAxis, unsigned int shortAxis, unsigned char color, char filled)
{
  // Set active window X
  writeReg(RA8875_HSAW0, 0);
  writeReg(RA8875_HSAW1, 0);
  writeReg(RA8875_HEAW0, 0x1F);
  writeReg(RA8875_HEAW1, 0x03);
  
  // Set active window Y
  writeReg(RA8875_VSAW0, 0);
  writeReg(RA8875_VSAW1, 0);  
  writeReg(RA8875_VEAW0, 0xDF);
  writeReg(RA8875_VEAW1, 0x01);
	
	writeReg (RA8875_CURH0, 0);
	writeReg (RA8875_CURH1, 0);
	writeReg (RA8875_CURV0, 0);
	writeReg (RA8875_CURV1, 0); 
	
  /* Set Center Point */
  writeReg(0xA5, xCenter);
  writeReg(0xA6, xCenter >> 8);
  writeReg(0xA7, yCenter);
  writeReg(0xA8, yCenter >> 8);

  /* Set Long and Short Axis */
  writeReg(0xA1, longAxis);
  writeReg(0xA2, longAxis >> 8);
  writeReg(0xA3, shortAxis);
  writeReg(0xA4, shortAxis >> 8);
  
  /* Set Color */
  writeReg(0x63, (color & 0xE0) >> 5); // red bits 7,6,5
  writeReg(0x64, (color & 0x1C) >> 2);  // green bits 4,3,2
  writeReg(0x65,  color & 0x03); // blue bits 1,0
  
  /* Draw! */
  if (filled) writeReg(0xA0, 0xC0); else writeReg(0xA0, 0x80);
  
  /* Wait for the command to finish */
  while (!(DISPLAY_BUSY_STATUS)) {}
}

// ======================================================================================
//      Draws a HW accelerated filled curve on the display
//
//      xCenter[in]   The 0-based x location of the ellipse's center
//      yCenter[in]   The 0-based y location of the ellipse's center
//      longAxis[in]  The size in pixels of the ellipse's long axis
//      shortAxis[in] The size in pixels of the ellipse's short axis
//      curvePart[in] The corner to draw, where in clock-wise motion:
//                    0 = 180-270°
//                    1 = 270-0°
//                    2 = 0-90°
//                    3 = 90-180°
//      color[in]     The RGB565 color to use when drawing the pixel
//			filled    		True or false
// ======================================================================================
void ra8875_curve_draw (unsigned int xCenter, unsigned int yCenter, unsigned int longAxis, unsigned int shortAxis, unsigned char curvePart, unsigned char color, char filled)
{
  // Set active window X
  writeReg(RA8875_HSAW0, 0);
  writeReg(RA8875_HSAW1, 0);
  writeReg(RA8875_HEAW0, 0x1F);
  writeReg(RA8875_HEAW1, 0x03);
  
