Yoda49/RA8875-driver-for-STM32F103/ra8875_driver.c
  // Set active window Y
  writeReg(RA8875_VSAW0, 0);
  writeReg(RA8875_VSAW1, 0);  
  writeReg(RA8875_VEAW0, 0xDF);
  writeReg(RA8875_VEAW1, 0x01);
	
	writeReg (RA8875_CURH0, 0);
	writeReg (RA8875_CURH1, 0);
	writeReg (RA8875_CURV0, 0);
	writeReg (RA8875_CURV1, 0); 
	
  /* Set Center Point */
  writeReg(0xA5, xCenter);
  writeReg(0xA6, xCenter >> 8);
  writeReg(0xA7, yCenter);
  writeReg(0xA8, yCenter >> 8);

  /* Set Long and Short Axis */
  writeReg(0xA1, longAxis);
  writeReg(0xA2, longAxis >> 8);
  writeReg(0xA3, shortAxis);
  writeReg(0xA4, shortAxis >> 8);
  
  /* Set Color */
  writeReg(0x63, (color & 0xE0) >> 5); // red bits 7,6,5
  writeReg(0x64, (color & 0x1C) >> 2);  // green bits 4,3,2
  writeReg(0x65,  color & 0x03); // blue bits 1,0

  /* Draw! */
  if (filled) writeReg(0xA0, 0xD0 | (curvePart & 0x03)); else writeReg(0xA0, 0x90 | (curvePart & 0x03));
  
  /* Wait for the command to finish */
  while (!(DISPLAY_BUSY_STATUS)) {}
}

// ======================================================================================
// GPIOX
// ======================================================================================
void ra8875_gpiox(char on)
{
  if (on) writeReg(RA8875_GPIOX, 1); else writeReg(RA8875_GPIOX, 0);
}

// ======================================================================================
// PWM1 OUT
// ======================================================================================
void ra8875_pwm1_out(unsigned char p)
{
  writeReg(RA8875_P1DCR, p);
	
	delay_ms (100);
}

// ======================================================================================
// PWM2 OUT
// ======================================================================================
void ra8875_pwm2_out(unsigned char p)
{
  writeReg(RA8875_P2DCR, p);
}

// ======================================================================================
// PWM1 config
// ======================================================================================
void ra8875_pwm1_config (char on, unsigned char clock)
{
  if (on) writeReg(RA8875_P1CR, RA8875_P1CR_ENABLE | (clock & 0xF)); else writeReg(RA8875_P1CR, RA8875_P1CR_DISABLE | (clock & 0xF));
}

// ======================================================================================
// PWM2 config
// ======================================================================================
void ra8875_pwm2_config (char on, unsigned char clock)
{
  if (on) writeReg(RA8875_P2CR, RA8875_P2CR_ENABLE | (clock & 0xF)); else writeReg(RA8875_P2CR, RA8875_P2CR_DISABLE | (clock & 0xF));
}

































// ======================================================================================
// LOW LEVEL FUNCTIONS
// ======================================================================================

void writeReg (unsigned char reg, unsigned char val) 
{
	CS_LCD_LOW;
	__nop ();
	
	SPI1->DR = RA8875_CMDWRITE;
	while (SPI1->SR & SPI_SR_BSY) {}
	SPI1->DR = reg;
	while (SPI1->SR & SPI_SR_BSY) {}
		
	__nop ();
	CS_LCD_HIGH;
	__nop ();
	CS_LCD_LOW;		
	__nop ();
		
	SPI1->DR = RA8875_DATAWRITE;
	while (SPI1->SR & SPI_SR_BSY) {}
	SPI1->DR = val;
	while (SPI1->SR & SPI_SR_BSY) {}
		
	__nop ();
	CS_LCD_HIGH;
	__nop ();
}



void writeData (unsigned char d) 
{
	CS_LCD_LOW;
	__nop ();
	
	SPI1->DR = RA8875_DATAWRITE;
	while (SPI1->SR & SPI_SR_BSY) {}
	SPI1->DR = d;
	while (SPI1->SR & SPI_SR_BSY) {}
		
	__nop ();
	CS_LCD_HIGH;
	__nop ();
}


void writeCommand (unsigned char d) 
{
	CS_LCD_LOW;
	__nop ();
	
	SPI1->DR = RA8875_CMDWRITE;
	while (SPI1->SR & SPI_SR_BSY) {}
	SPI1->DR = d;
	while (SPI1->SR & SPI_SR_BSY) {}
		
	__nop ();
	CS_LCD_HIGH;
	__nop ();
}


